app/views/users/show.html.erb

SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1  [["user_id", 113]]
---
  <div class="index">
     <% @current_user.properties.each do |property| %>