rental/app/controllers/properties_controller.rb

  def create #4
  property = Property.create property_params
  @current_user.properties << property
    if params[:property][:photos].present?
      req = Cloudinary::Uploader.upload params[:property][:photos]
      property.photos = req["public_id"]
      property.save
---
UPDATE "properties" SET "updated_at" = $1, "user_id" = $2 WHERE "properties"."id" = $3  [["updated_at", "2021-10-25 02:36:07.564455"], ["user_id", 113], ["id", 65]]