rental/app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index #step 1
    @properties = Property.all

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def show #2
    @properties = Property.find params[:id]

INSERT INTO "properties" ("adress", "suburb", "postcode", "photos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create #4
    property = Property.create property_params

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def edit #5
    @properties = Property.find params[:id]

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "properties" SET "livingrooms" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["livingrooms", 333], ["updated_at", "2021-10-24 04:46:07.638893"], ["id", 35]]
---
  def update
    properties = Property.find params[:id]
    properties.update property_params

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 38]]
---
  def destroy
   properties = Property.find params[:id]
   properties.destroy