rental/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asd@d"], ["LIMIT", 1]]
---
  def create
    #get users
    user = User.find_by :email => params[:email]