rental/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "new@ga"], ["created_at", "2021-10-24 23:32:36.302448"], ["updated_at", "2021-10-24 23:32:36.302448"], ["password_digest", "$2a$12$gSdTxh7TE4SwOdZwDzIhCOgSiRdHqJVwkB/RSbr7Xgda2pgn2hitG"]]
---
  def create
    @user = User.new user_params
    if @user.save