app/views/properties/_form.html.erb

       <br>
        <%= collection_check_boxes :property, :agent_ids, Agent.all, :id, :name %>
---
SELECT "agents".* FROM "agents"