app/views/properties/show.html.erb


      <% @properties.agents.each do |property| %>
---
SELECT "agents".* FROM "agents" INNER JOIN "agents_properties" ON "agents"."id" = "agents_properties"."agent_id" WHERE "agents_properties"."property_id" = $1  [["property_id", 37]]