app/controllers/agents_controller.rb

SELECT "agents".* FROM "agents"
---
  def index #1
    @agents = Agent.all

SELECT  "agents".* FROM "agents" WHERE "agents"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
  def show #2
    @agents = Agent.find params[:id]

INSERT INTO "agents" ("name", "surname", "mobile", "phone", "email", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "Ivance"], ["surname", "ddd"], ["mobile", ""], ["phone", ""], ["email", ""], ["image", ""], ["created_at", "2021-10-24 05:45:02.557827"], ["updated_at", "2021-10-24 05:45:02.557827"]]
---
  def create #4
    agent = Agent.create agent_params

SELECT  "agents".* FROM "agents" WHERE "agents"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
  def edit #5
    @agents = Agent.find params[:id]

SELECT  "agents".* FROM "agents" WHERE "agents"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "agents" SET "image" = $1, "updated_at" = $2 WHERE "agents"."id" = $3  [["image", "https://i.kym-cdn.com/entries/icons/original/000/000/091/TrollFace.jpg"], ["updated_at", "2021-10-24 10:49:51.675140"], ["id", 50]]
---
  def update #6
    agents = Agent.find params[:id]
    agents.update agent_params

SELECT  "agents".* FROM "agents" WHERE "agents"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
DELETE FROM "agents" WHERE "agents"."id" = $1  [["id", 48]]
---
  def destroy #7
    agents = Agent.find params[:id]
    agents.destroy