app/controllers/properties_controller.rb

  def index #step 1
    @message = ""
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def show #2
    @properties = Property.find params[:id]
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def create #4
  property = Property.create property_params
  @current_user.properties << property
    if params[:property][:photos].present?
      req = Cloudinary::Uploader.upload params[:property][:photos]
      property.photos = req["public_id"]
      property.save
---
INSERT INTO "properties" ("adress", "suburb", "postcode", "photos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "properties" SET "rooms" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["rooms", 0], ["updated_at", "2021-10-25 07:30:45.571349"], ["id", 66]]

  def edit #5
    @properties = Property.find params[:id]
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]

  def update #6
      properties = Property.find params[:id]
      properties.update property_params
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "properties" SET "livingrooms" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["livingrooms", 333], ["updated_at", "2021-10-24 04:46:07.638893"], ["id", 35]]

  def destroy #7
   properties = Property.find params[:id]
   properties.destroy
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 38]]