app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "new@ga"], ["created_at", "2021-10-24 23:32:36.302448"], ["updated_at", "2021-10-24 23:32:36.302448"], ["password_digest", "$2a$12$gSdTxh7TE4SwOdZwDzIhCOgSiRdHqJVwkB/RSbr7Xgda2pgn2hitG"]]
---
 def create
  @user = User.new user_params
   if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 113], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "surname" = $2, "phone" = $3, "mobile" = $4, "image" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["name", "Ivan"], ["surname", "Veselinov"], ["phone", ""], ["mobile", ""], ["image", ""], ["updated_at", "2021-10-25 05:55:35.541480"], ["id", 114]]
---
 def update
  users = User.find params[:id]
  users.update user_params