rental/app/views/properties/_form.html.erb

SELECT "agents".* FROM "agents"
---
<%= f.label :agent_ids %>
<%= collection_check_boxes :property, :agent_ids, Agent.all, :id, :name %>